 [
    {
      "title": "Vidhyarthi Bhavan (Not this place again!) ",
      "body": "You must have heard about this place over a million times by now but see, we really got to begin with the gold standard. Vidhyarthi Bhavan was founded in 1943 by Venketarama Ural to serve students who originally hailed from outside the city who were attending the nearby schools in Gandhi Bazaar (an area known historically for having a high concentration of educational institutions). At that time, newly opened restaurants would be given names that featured the word Bhavan (which literally means ‘house’) at the end, which led to the establishment using this name. Later, Parameshwara Udal took control before selling it to the current owner Ramakrishna Adiga in 1970. Vidhyarthi Bhavan celebrated its 75th anniversary in 2018 with a silver jubilee celebration and by releasing a coffee table book, and India post released a special postal cover and stamp in the same year. The restaurant features a small menu of South Indian breakfast items and is known for keeping its furniture and food as close to its original state as possible. It is particularly noted for its crispy and buttery masala dose, considered its signature dish. Arun Adiga, Ramakrishna's son, credits its taste to using specific and unique proportions of red rice, methi and urad dal in the recipe compared to other places. The restaurant is also known for its clientele, with writers in particular patronizing the restaurant and using it as a 'creative meeting space'. At peak times, the restaurant is so popular that customers have to wait outside before their name is called to enter and often end up sharing tables. ",
      "author": "Nakul Sidarth",
      "id": 1,
      "img": "'https://i.ibb.co/MDs4PLB/1.jpg'",
      "location": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3888.4181147089357!2d77.5692009146117!3d12.945075690873267!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae15f2e88ad035%3A0xed7fede7791f8edc!2sVidyarthi%20Bhavana!5e0!3m2!1sen!2sin!4v1645776772284!5m2!1sen!2sin",
      "body2": "Idli Vada: 8/10\n A delightful plate of fluffy soft idlis and traditional uddina vada bathed in tasty, hot sambar. The chutney, although a little runny, is enhanced with a punch of spice and a delicious tempering.  \n\n Poori Saagu: 8/10\n This poori saagu is a humble yet delicious dish at VB. A medley of beans, carrots, brinjal, and sweet pumpkin all harmoniously brought together. The pooris are light and fluffy as you would expect. The chutney adds a flavorful punch. \n\n Khara bath: 8/10\n This semolina concoction with veggies like carrots, onions and the simple tempering has a pleasing texture. This is a dish that needs no accomplice. \n\n Kesari Bath: 8/10\n This bath is laden with copious amounts of ghee, and tiny morsels of pineapple to give it that sweet, tarty flavor also the intense flavor of clove, cuts through the richness, making this an irresistible bite.  \n \n Saagu masala dosa: 9/10\n This dosa is roasted perfectly with a crackly exterior and a soft interior. That slight tartness of the batter is present in every bite. The delicious saagu is a wholesome change from the typical potato stuffing. \n\n Masala dosa: 10/10  \n A traditional masala dosa in every sense, served with chutney. The dosa is roasted to a nice deep brown crisp around the edges, yet soft and fluffy within. The flavorful potato palya is gently tempered. \n\n Filter coffee: 9/10\n Robust coffee topped with frothy cream. Pull your coffee to cool it down and end your meal in an authentic way.  "
    },
    {
      "title": "Udupi Sri Krishna Bhavan ",
      "body": "When it comes to festive vegetarian indulgence here in Namma Bengaluru, one looks forward to a good baale yele oota, a meal that is served on a banana leaf. And a popular one at that is the 25-dish special lunch served at the Gandhi Bazaar, Basavanagudi outpost of ‘Udupi Sri Krishna Bhavan’, a vegetarian eatery that first opened doors in 1926. We even got the opportunity to step into their kitchen to catch the making of a steamed ‘kadubu’ and the South Canara style rasam, known as the Tilli Saaru, by Ganesh, their ‘adige bhatru’, or chief cook, who has been cooking here for over 40 years. There is something truly auspicious about eating off a banana leaf. I hope you enjoy this episode.",
      "author": "Nakul Sidarth",
      "id": 2,
      "img": "'https://i.ibb.co/N6zZ1p1/1.jpg'",
      "location": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d15553.608241885055!2d77.56184666977538!3d12.946104800000006!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae15f2fc55a005%3A0x8ae1ac732d3ec3c3!2sUdupi%20Sri%20Krishna%20Bhavan!5e0!3m2!1sen!2sin!4v1645778675666!5m2!1sen!2sin",

      "body2": "Special Banana Leaf Lunch: 9/10\nThis is an indulgent lunch affair representative of the flavours of the Udupi-Kundapura region in most of the 25-dishes that make for a typical baale yele oota offering here. The food is served hot and fresh, and conveys a wholesome, pleasing and satisfying experience. One begins with a traditional grape juice and mosaru vade, menasinkai bhajji, kosambari, kadubu-chutney, couple of coconut-rich vegetables before proceeding to the substantial mains of poori-saagu, anna (rice) served with tilli saaru and sambar. Servings are unlimited, and the servers are quick and efficient in dispensing refills. Make sure you save space for the desserts: payasa and hollige, before you close with curd rice, a banana and a beeda, in true South Canara style."
    },
    {
      "title": "Hotel Dwarka ",
      "body": "For nearly half a century Hotel Dwarka has ruled the South Bengaluru palate, when it comes to the Khaali dose, though not as popular as the ubiquitous masala dose, is much revered by dosa maniacs. Intrigued, we visit this eatery to taste their khaali dose, and also discover that though its name may mean ‘empty’ in Kannada, there’s much that goes into its making that has earned for Dwarka the moniker, ‘Khaali Dose Hotel’. Hope you enjoy the read.",
      "author": "Nakul Sidarth",
      "id": 3,
      "img": "'https://i.ibb.co/684VTsK/1.jpg'",
      "location":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3888.5336122847198!2d77.56565411461159!3d12.93766969087817!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae158c001b1d45%3A0x4c1f091a8dfde839!2sHotel%20Dwarka!5e0!3m2!1sen!2sin!4v1645778739497!5m2!1sen!2sin",
      "body2": "Khaali Dosa: 9/10 \nThe khaali dose, served in a pair, is soft and spongy, topped with mini-dollops of butter. When eaten piping hot with a generous smear of the butter, it’s the sort that when placed in the mouth dissolves with little effort. The chutney served alongside is the right consistency to seep through the porous dose with its spicy fervor. The potato palya is flavorful, but the main act here is the dose, butter and chutney. \n\nTomato Dosa: 8/10 \nIn stark contrast to the austere khaali dose, the tomato dose is enriched with tomato, onions, coriander, ginger, lending it a flavorful opulence on the palate. Though it is served with a tasty vegetable saagu and chutney, it is flavorful enough to be savored on its own.\n\nCarrot Halwa: 7/10 \nThe carrot halwa is a ‘rich’, sweet, and popular end to the meal"
    },

    {
      "title": "Kamat Bugle Rock",
      "body": "What we find most appealing about a good North Karnataka meal is its balanced approach when it comes to nutrition, the meal components, both raw and cooked, dishes that complement and contrast, not just in taste and textures, but also in the warming and cooling impact that they have on the body. A good representation of this culinary ethos is the jowar bhakri meal served at Kamat Bugle Rock in Basavanagudi. Part of the Kamat Yatri Niwas group that first brought North Karnataka cuisine to Bengaluru in a restaurant format, this 17-year-old eatery serves a satisfying jolada rotti oota, albeit with flavours slightly tweaked to better suit the palate of this South Bengaluru suburb. Hope you enjoy the read.",
      "author": "Nakul Sidarth",
      "id": 4,
      "img": "'https://i.ibb.co/0X7vqRH/1.jpg'",
      "location":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3888.4985067097223!2d77.56456951482168!3d12.9399211908767!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae158b9103b75d%3A0x6242da3fa0a1d5e4!2sKamat%20Bugle%20Rock!5e0!3m2!1sen!2sin!4v1645778811013!5m2!1sen!2sin",
      "body2": "Jowar Bhakri Meal:8/10 \nThe meal opens with a bele obattu laden with loads of ghee, though the hollige is given only once the rest of the meal is unlimited, you are then served with the fenugreek leaves, cucumber and the spring onions as the raw part of your meal, with this you are also give a happala, the protein rich chick pea junka is also served later. Next the palya is served (brinjal palya, bele palya and soppu palya), the chutney pudi (Red pudi, peanut pudi, Niger seed pudi) is already present on the table, butter for the rotti and curd are also available on demand to dilute the effect of the spice on your palate. After eating sambar rice and curd rice till your heart’s content the meal closes with one banana and a scoop of ice cream over fruit salad."
    },
    {
      "title": "EAT repEAT ",
      "body": "A café set in a home, Eat Repeat is a venture by IT professionals turned entrepreneurs Kannan and Sangeetha. It is an ode to their Iyengar heritage. Bound to authentic traditions, the vegetarian dishes here are devoid of onion and garlic, but pack loads of flavour, as we discovered in the Puliyogare, Chakkara Pongal and some of the other tiffin items. The fare is simple yet wholesome, made and served with the sort of love, conversation and attention that one would expect as a guest in someone’s home. After all, one is dining at Sangeetha and Kannan’s beautiful abode. Hope you enjoy this read. ",
      "author": "Nakul Sidarth",
      "id": 5,
      "img": "'https://i.ibb.co/rHVXjjx/1.jpg'",
      "location":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3888.4985067097223!2d77.56456951482168!3d12.9399211908767!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae158bf49012c1%3A0x6412b8cb83a423a6!2sEat%20Rep%20Eat!5e0!3m2!1sen!2sin!4v1645778874625!5m2!1sen!2sin",
      "body2": "Benne Pudi Thatte: 9/10 \nSoft and fluffy idlis drenched in generous amounts of butter and chutney pudi, the aroma is sufficient to tease the consumer. The butter helps calm down the fiery aggression of the spicy chutney pudi, this idly is made in the typical Tamil style and is the perfect combination between a fluffy idly and a nutty pudi to top it, it is served with kadle bele chutney.  \nBenne Khali Dosa: 8/10\nThe Benne khali dose, served in a pair, is soft and spongy, topped with mini-blobs of butter. When eaten piping hot with a generous smear of butter, it’s the sort that when placed in the mouth disintegrates with little effort. The chutney served alongside is the right consistency to work its way right through the porous dose with its spicy flavour. The main act here is the dose, butter and chutney. \n\nMasala Dosa: 8/10\nA simple traditional home like masala dosa, served with chutney. The dosa is roasted well to keep it crispy, yet soft within. The flavourful potato palya is well made too. \n\nPuliyogare: 9.5/10\nGenerously infused with the tamarind based puliyogare gojju, this rice dish is hand mixed with loads of roasted dry coconut shavings to enhance the flavour and texture of the puliyogare, this dish is packed with spice which will definitely make your palate warm, it’s served with curd.\n\nRice Nalagiri: 8/10\nAllegedly the recipe of the royal Indian master chef ‘Nala Maharaja’, is a special sambar served with rice, this sambar is laden with ash gourd cubes, tomato and horse gram, the ash gourd is so well soaked with the sambar, every time you eat the ash gourd, the vegetable literally melts in your mouth leaving behind a pool of flavourful sambar.\n\nAmbode: 8/10 \nThis is a masala vade devoid of the onion, it’s made of kadle bele, has loads of green chillies and is a crunchy snack well suited with the Rice Nalagiri.\n\nChakara Pongal: 9/10 \nA rice based dish where rice and moong dal are pressure cooked to later milk and jaggery are added to give it a sweet overdose, it’s a great ending to any meal you’ll have at this place.\n"
    },
    {
      "title": "VV Puram Food Street ",
      "body": "In this street food trail at Thindi Beedi, we begin our trail at the legendary VB Bakery to taste three recommended treats, starting with the signature KBC or Khara Butter Bun Congress, a butter jam bun and the honey cake. Following this, we make a trip to Shree Swamy Bajji Center to taste five scrumptious bajjis! Next on the list is a unique, smokey Tandoori Chai, special chaats from Chandra Chaat Center and highly recommended street snack, the Mosaru Kodubale or the Curd Kodubale. We begin our second half of the trip by tasting a super scrumptious Avarekalu Vada served piping hot, followed by a wholesome Avarebele Akki Rotti served with an saaru and crusty, Paddus. We then visits over 45 year old Guru Idlis to try their Mini Idlis. Rounding off the trail on a sweet note, we taste two types of Holige, a glass of nutritious Badam Milk and the super popular Gulcan Ice Cream. To help digest the 21-dishes we savoured, we end with a Fire Paan! ",
      "author": "Nakul Sidarth",
      "id": 6,
      "img": "'https://i.ibb.co/rHVXjjx/1.jpg'",
      "location":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3888.305205558691!2d77.57538511377312!3d12.952311690868521!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae15eeea41b2d1%3A0x74326a422ef1ef9c!2sFood%20St%2C%20Vishweshwarapura%2C%20Basavanagudi%2C%20Bengaluru%2C%20Karnataka%20560004!5e0!3m2!1sen!2sin!4v1645778917320!5m2!1sen!2sin",
      "body2": "*VB BAKERY\nKHARA BUTTER AND CONGRESS KADLEKAI BUN: 9/10 \nThe first flavour to hit your palate is the savouriness of the curry leaves. You taste the buttery goodness, followed by the chilli and the crunch of the peanuts! This could very well be the Iyengar version of the peanut butter sandwich! \nBUN BUTTER JAM: 8/10\nThis special bun is made with milk powder and has some raisins in it too. Slathered with a generous lashing of butter and mixed fruit jam, this dish is a slice of nostalgia packed in a bun!\nHONEYCAKE: 8/10\nMade with pure coorg honey, this honey cake is dense and sticky. The top is light, airy and spongy but the bottom is where the sugary attack of the honey hits you. \n\n*SHREE SWAMY BAJJI CENTER  \nOOTY MENASINAKAI BAJJI: 8/10  \nThe ooty pepper in itself does not have too much heat but that raw chilli powder sprinkled on top certainly has a kick to it. This bajji will be a treat on a rainy day!\nCAPSICUM BAJJI: 8/10\nA whole capsicum fried to scrumptiousness. The capsicum still retains its fresh crunch despite being fried. Ticks all the boxes if you are considering a nice evening snack. \nALU BONDA: 8/10\nDelightful fried snack that is super hot and made fresh. An absolute steal for a tasty snack!\nBANANA BAJJI: 8.5/10 \nLove how the raw, starchy banana tones down the spice in that chutney and chilli powder sprinkled on top. The bajji is deliciously crisp when eaten seconds after it is fried! \nPINEAPPLE BAJJI: 7/10 \nA large slice of pineapple battered fried and then sliced and topped with chutney and a garnish of onions and carrots! A definite first for us.   \n\n*NAMMA KITCHEN \nTANDOORI CHAI:  8/10 \nCertainly a tasty tea spiced with cinnamon and ginger. What makes this a tandoori chai is that smokey flavour present in every sip! Perfect for a nippy evening.\n\n*CHANDRA CHAAT CENTER AND PAV BHAJI \nMASALA PURI: 7/10 \nThis masala puri isn’t too spicy as one would expect. What you really taste is the fragrant spicing in the masala base and the slight sweet pop of the peas.\n DAHI PURI: 9/10 \nA loaded dahi puri. One bite and the puri just oozes all the delicious dahi with the stuffing of the boiled potatoes. You can also taste the spice of the garam masala.\nGULAB JAMUN: 8/10 \nThis gulab jamun made using a special recipe is soft, creamy and perfectly sweet. The richness from the khova makes you want to keep going back for seconds.  \n\n*ARYA VYSYA \nMOSARU KODUBALE: 9/10 \nThe mosaru kodubale was a scrumptious discovery. The crunchy exterior gives way to the gooey, porous inside. There’s a hint of chilli and cumin flavour. \n\n*SRI VASAVI VAISISTA THINDI \nAVAREKALU VADA: 9/10\nThis vada is every fried food lover’s delight! Made using a mixture of water hyacinth bean, dill, gram flour and aromats like onion, ginger, garlic, chilli and coriander this is as delicious and nutritious as a vada can get. In short, hot, crunchy and mouth watering!  \n\n*SRI VASAVI MANE THINDI\nAVEREBELE AKKI ROTTI:  7.5/10\nThis dish is a full meal. The akki rotti has a crunchy crust and a soft inside. The gravy however, is quite tame. The avarekalu in the rotti makes for a tasty textural relief.\nPADDU: 8/10 \nAn enriched dosa batter that is cooked on a tava speckled with spherical cavities. It has a slight sour twang coupled with the crunch of the onions and freshness of the dill. Delicious when eaten with coconut, chana dal and green chilli chutney. "
    },
    {
      "title": "Sreenivasa Brahmins Bakery ",
      "body": "When it comes to festive vegetarian indulgence here in Namma Bengaluru, one looks forward to a good baale yele oota, a meal that is served on a banana leaf. And a popular one at that is the 25-dish special lunch served at the Gandhi Bazaar, Basavanagudi outpost of ‘Udupi Sri Krishna Bhavan’, a vegetarian eatery that first opened doors in 1926. We even got the opportunity to step into their kitchen to catch the making of a steamed ‘kadubu’ and the South Canara style rasam, known as the Tilli Saaru, by Ganesh, their ‘adige bhatru’, or chief cook, who has been cooking here for over 40 years. There is something truly auspicious about eating off a banana leaf. I hope you enjoy this episode.",
      "author": "Nakul Sidarth",
      "id": 7,
      "img": "'https://i.ibb.co/1r2SrLj/1.jpg'",
      "location":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3888.4459018179787!2d77.56885971377301!3d12.943294290874455!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bae158d2c4e38ab%3A0x95748ad7d3b34008!2sSreenivasa%20Brahmins%20Bakery!5e0!3m2!1sen!2sin!4v1645778952672!5m2!1sen!2sin",
      "body2": "KBC: 8.5/10 \n\nPalya bun: 9.5/10 \n\nCapsicum puff: 9/10 \n\nBaked nippat: 8/10 \n\nCongress kadlekai: 10/10 \n\nBonda kadalebeeja: 8/10\n\nKaralee fry: 8/10\n\nPepper kadlekai: 8.5/10\n\nHoney cake: 7.5/10\n"
    }
  ]